БухЭксп/Catalogs/CW_ОбменГИСЭПДАлгоритмыЗаполненияРеквизитовЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбменГИСЭПДАлгоритмыЗаполненияРеквизитовЭПД</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращаемоеЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ОбменГИСЭПДВидыРезультатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеВозвращаемогоЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФункцииЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФункцияЗначения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ОбменГИСЭПДФункцииЗначенийРеквизитовЭПД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборПоНомеруСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ОбменГИСЭПДВидыРезультатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ОбменГИСЭПДВидыРезультатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбменГИСЭПДАлгоритмыЗаполненияРеквизитовЭПД/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ОбменГИСЭПДДополнительный.ЗаполнитьДоступныеТипыОбъектов(ЭтотОбъект);
	
	УстановитьАдерсСхемыКомпоновки();

	ЗаполнитьДополнительныеКолонки();
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		КопируемааяТаблица = Параметры.ЗначениеКопирования.ФункцииЗначения;
		Для Каждого СтрокаТаблицы из Объект.ФункцииЗначения Цикл
			
			ИндексСтроки 		= Объект.ФункцииЗначения.Индекс(СтрокаТаблицы);  
			
			КопируемаяСтрока 	= КопируемааяТаблица[ИндексСтроки];
			НастройкаОтбора		= КопируемаяСтрока.ХранилищеОтбора.Получить();
			
			СтрокаТаблицы.АдресОтбора = ПоместитьВоВременноеХранилище(НастройкаОтбора, Новый УникальныйИдентификатор);
			Если НастройкаОтбора <> Неопределено Тогда
				СтрокаТаблицы.НаличеОтбора   = НастройкаОтбора.Отбор.Элементы.Количество() > 0; 
			Конецесли;
		КонецЦикла;
	КонецЕсли;

  ВозвращаемоеЗначениеПриИзмененииНаСервере();
  
КонецПроцедуры

&НаСервере
Процедура УстановитьАдерсСхемыКомпоновки()
	
	Если ЗначениеЗаполнено(Объект.ТипОбъекта) Тогда
		СхемаКомпоновкиДанных = CW_ОбменГИСЭПДДополнительный.ПолучитьСхемуКомпоновкиДанных(Объект.ТипОбъекта);
		АдресСхемы 			  = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,Этаформа.УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры   

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаОбъекта из ТекущийОбъект.ФункцииЗначения	Цикл
		ИндексСтроки  = ТекущийОбъект.ФункцииЗначения.Индекс(СтрокаОбъекта);  
		СтрокаТекущая = Объект.ФункцииЗначения[ИндексСтроки];   
		
		НастройкаОтбора = Неопределено;
		Если ЭтоАдресВременногоХранилища(СтрокаТекущая.АдресОтбора) Тогда
			НастройкаОтбора = ПолучитьИзВременногоХранилища(СтрокаТекущая.АдресОтбора); 
		КонецЕсли;
		
		СтрокаОбъекта.ХранилищеОтбора = Новый ХранилищеЗначения(НастройкаОтбора, Новый СжатиеДанных(9));
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьДополнительныеКолонки();
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДополнительныеКолонки()

	ТОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого СтрокаОтбора из ТОбъект.ФункцииЗначения  Цикл           
		НастройкаОтбора	= СтрокаОтбора.ХранилищеОтбора.Получить();
		ИндексСтроки	= ТОбъект.ФункцииЗначения.Индекс(СтрокаОтбора);
		
		СтрокаОбъекта = Объект.ФункцииЗначения.Получить(ИндексСтроки);
		СтрокаОбъекта.АдресОтбора 	 = ПоместитьВоВременноеХранилище(НастройкаОтбора, Новый УникальныйИдентификатор);    
		Если НастройкаОтбора <> Неопределено Тогда
			СтрокаОбъекта.НаличеОтбора   = НастройкаОтбора.Отбор.Элементы.Количество() > 0; 
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УсловияЗначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда       
		СтандартнаяОбработка = Ложь;   
		
		ТекущиеДанные = Элементы.УсловияЗначения.ТекущиеДанные;   
		АдресОтбора = ТекущиеДанные.АдресОтбора;
		Если Не ЭтоАдресВременногоХранилища(АдресОтбора) Тогда
			АдресОтбора 				= ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор); 
			ТекущиеДанные.АдресОтбора 	= АдресОтбора;
		КонецЕсли;  
		
		ДополнительныеПараметры = Новый Структура;   
		ДополнительныеПараметры.Вставить("ТекущиеДанные", 	ТекущиеДанные);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияОтбораИСортировки", ЭтотОбъект, ДополнительныеПараметры);   
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресСхемы",	АдресСхемы);
		ПараметрыФормы.Вставить("АдресОтбора",	АдресОтбора);
		
		ОткрытьФорму("Справочник.CW_ОбменГИСЭПДАлгоритмыЗаполненияРеквизитовЭПД.Форма.ФормаРедактированияОтбора", ПараметрыФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
Процедура ОбработкаИзмененияОтбораИСортировки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОтбора = ПолучитьИзВременногоХранилища(ДополнительныеПараметры.ТекущиеДанные.АдресОтбора); 
	
	ДополнительныеПараметры.ТекущиеДанные.НаличеОтбора	= НастройкаОтбора <> Неопределено; 
	Если НастройкаОтбора <> Неопределено Тогда
		ДополнительныеПараметры.ТекущиеДанные.НаличеОтбора   = НастройкаОтбора.Отбор.Элементы.Количество() > 0; 
	КонецЕсли;    
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура УсловияЗначенияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.УсловияЗначения.ТекущиеДанные;   
	Если Копирование Тогда  
		КопируемаяНастройка = ПолучитьИзВременногоХранилища(ТекущиеДанные.АдресОтбора);
	КонецЕсли; 
	
	ТекущиеДанные.АдресОтбора = ПоместитьВоВременноеХранилище(КопируемаяНастройка, Новый УникальныйИдентификатор);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)    
	
	УстановитьАдерсСхемыКомпоновки(); 
	
КонецПроцедуры

&НаСервере
Процедура ВозвращаемоеЗначениеПриИзмененииНаСервере()  
	
	Элементы.УсловияЗначенияОтборПоНомеруСтроки.Видимость = 
		(Объект.ВозвращаемоеЗначение = ПредопределенноеЗначение("Перечисление.CW_ОбменГИСЭПДВидыРезультатов.ЗначениеРеквизита"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвращаемоеЗначениеПриИзменении(Элемент)
	ВозвращаемоеЗначениеПриИзмененииНаСервере();
КонецПроцедуры
